src/InformationRegisters/ПорядокПлатежногоКалендаря/ПорядокПлатежногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокПлатежногоКалендаря</name>
  <resources>
    <name>ПорядокВПлатежномКалендаре</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеГруппировки</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      <types>CatalogRef.Партнеры</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ПлатежныйКалендарьСерверПовтИсп/Module.bsl
Функция ВалютаПоФормеОплатыИДанным(БанковскийСчетКасса, ВалютаДокумента) Экспорт
	
	Если Не ЗначениеЗаполнено(БанковскийСчетКасса) Тогда
		Возврат ВалютаДокумента;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчетКасса, "ВалютаДенежныхСредств");
	
КонецФункции

Функция ПредставлениеВалютыПоФормеОплатыИДанным(БанковскийСчетКасса, ВалютаДокумента) Экспорт
	
	Валюта = ПлатежныйКалендарьСерверПовтИсп.ВалютаПоФормеОплатыИДанным(БанковскийСчетКасса, ВалютаДокумента);
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Валюта, "Представление");
	
КонецФункции

Функция ТаблицаПорядкаДерева() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.ПорядокПлатежногоКалендаря КАК ПорядокПлатежногоКалендаря";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПорядка = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаПорядка;
	
КонецФункции

Функция КурсВалюты(Валюта, ДатаКурса) Экспорт
	
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ДатаКурса);
	
КонецФункции
